MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ192GA106/mcu.h
#define WPFP_WPFP0           0xFE00
#define WPFP_WPFP1           0xFE01
#define WPFP_WPFP2           0xFE02
#define WPFP_WPFP3           0xFE03
#define WPFP_WPFP4           0xFE04
#define WPFP_WPFP5           0xFE05
#define WPFP_WPFP6           0xFE06
#define WPFP_WPFP7           0xFE07
#define WPFP_WPFP8           0xFE08
#define WPFP_WPFP9           0xFE09
#define WPFP_WPFP10          0xFE0A
#define WPFP_WPFP11          0xFE0B
#define WPFP_WPFP12          0xFE0C
#define WPFP_WPFP13          0xFE0D
#define WPFP_WPFP14          0xFE0E
#define WPFP_WPFP15          0xFE0F
#define WPFP_WPFP16          0xFE10
#define WPFP_WPFP17          0xFE11
#define WPFP_WPFP18          0xFE12
#define WPFP_WPFP19          0xFE13
#define WPFP_WPFP20          0xFE14
#define WPFP_WPFP21          0xFE15
#define WPFP_WPFP22          0xFE16
#define WPFP_WPFP23          0xFE17
#define WPFP_WPFP24          0xFE18
#define WPFP_WPFP25          0xFE19
#define WPFP_WPFP26          0xFE1A
#define WPFP_WPFP27          0xFE1B
#define WPFP_WPFP28          0xFE1C
#define WPFP_WPFP29          0xFE1D
#define WPFP_WPFP30          0xFE1E
#define WPFP_WPFP31          0xFE1F
#define WPFP_WPFP32          0xFE20
#define WPFP_WPFP33          0xFE21
#define WPFP_WPFP34          0xFE22
#define WPFP_WPFP35          0xFE23
#define WPFP_WPFP36          0xFE24
#define WPFP_WPFP37          0xFE25
#define WPFP_WPFP38          0xFE26
#define WPFP_WPFP39          0xFE27
#define WPFP_WPFP40          0xFE28
#define WPFP_WPFP41          0xFE29
#define WPFP_WPFP42          0xFE2A
#define WPFP_WPFP43          0xFE2B
#define WPFP_WPFP44          0xFE2C
#define WPFP_WPFP45          0xFE2D
#define WPFP_WPFP46          0xFE2E
#define WPFP_WPFP47          0xFE2F
#define WPFP_WPFP48          0xFE30
#define WPFP_WPFP49          0xFE31
#define WPFP_WPFP50          0xFE32
#define WPFP_WPFP51          0xFE33
#define WPFP_WPFP52          0xFE34
#define WPFP_WPFP53          0xFE35
#define WPFP_WPFP54          0xFE36
#define WPFP_WPFP55          0xFE37
#define WPFP_WPFP56          0xFE38
#define WPFP_WPFP57          0xFE39
#define WPFP_WPFP58          0xFE3A
#define WPFP_WPFP59          0xFE3B
#define WPFP_WPFP60          0xFE3C
#define WPFP_WPFP61          0xFE3D
#define WPFP_WPFP62          0xFE3E
#define WPFP_WPFP63          0xFE3F
#define WPFP_WPFP64          0xFE40
#define WPFP_WPFP65          0xFE41
#define WPFP_WPFP66          0xFE42
#define WPFP_WPFP67          0xFE43
#define WPFP_WPFP68          0xFE44
#define WPFP_WPFP69          0xFE45
#define WPFP_WPFP70          0xFE46
#define WPFP_WPFP71          0xFE47
#define WPFP_WPFP72          0xFE48
#define WPFP_WPFP73          0xFE49
#define WPFP_WPFP74          0xFE4A
#define WPFP_WPFP75          0xFE4B
#define WPFP_WPFP76          0xFE4C
#define WPFP_WPFP77          0xFE4D
#define WPFP_WPFP78          0xFE4E
#define WPFP_WPFP79          0xFE4F
#define WPFP_WPFP80          0xFE50
#define WPFP_WPFP81          0xFE51
#define WPFP_WPFP82          0xFE52
#define WPFP_WPFP83          0xFE53
#define WPFP_WPFP84          0xFE54
#define WPFP_WPFP85          0xFE55
#define WPFP_WPFP86          0xFE56
#define WPFP_WPFP87          0xFE57
#define WPFP_WPFP88          0xFE58
#define WPFP_WPFP89          0xFE59
#define WPFP_WPFP90          0xFE5A
#define WPFP_WPFP91          0xFE5B
#define WPFP_WPFP92          0xFE5C
#define WPFP_WPFP93          0xFE5D
#define WPFP_WPFP94          0xFE5E
#define WPFP_WPFP95          0xFE5F
#define WPFP_WPFP96          0xFE60
#define WPFP_WPFP97          0xFE61
#define WPFP_WPFP98          0xFE62
#define WPFP_WPFP99          0xFE63
#define WPFP_WPFP100         0xFE64
#define WPFP_WPFP101         0xFE65
#define WPFP_WPFP102         0xFE66
#define WPFP_WPFP103         0xFE67
#define WPFP_WPFP104         0xFE68
#define WPFP_WPFP105         0xFE69
#define WPFP_WPFP106         0xFE6A
#define WPFP_WPFP107         0xFE6B
#define WPFP_WPFP108         0xFE6C
#define WPFP_WPFP109         0xFE6D
#define WPFP_WPFP110         0xFE6E
#define WPFP_WPFP111         0xFE6F
#define WPFP_WPFP112         0xFE70
#define WPFP_WPFP113         0xFE71
#define WPFP_WPFP114         0xFE72
#define WPFP_WPFP115         0xFE73
#define WPFP_WPFP116         0xFE74
#define WPFP_WPFP117         0xFE75
#define WPFP_WPFP118         0xFE76
#define WPFP_WPFP119         0xFE77
#define WPFP_WPFP120         0xFE78
#define WPFP_WPFP121         0xFE79
#define WPFP_WPFP122         0xFE7A
#define WPFP_WPFP123         0xFE7B
#define WPFP_WPFP124         0xFE7C
#define WPFP_WPFP125         0xFE7D
#define WPFP_WPFP126         0xFE7E
#define WPFP_WPFP127         0xFE7F
#define WPFP_WPFP128         0xFE80
#define WPFP_WPFP129         0xFE81
#define WPFP_WPFP130         0xFE82
#define WPFP_WPFP511         0xFFFF

#define WPDIS_WPEN           0xDFFF
#define WPDIS_WPDIS          0xFFFF

#define WPCFG_WPCFGEN        0xBFFF
#define WPCFG_WPCFGDIS       0xFFFF

#define WPEND_WPSTARTMEM     0x7FFF
#define WPEND_WPENDMEM       0xFFFF

/* Register CONFIG2 (0x20bfc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _CONFIG2;
#define _CONFIG2(x) __attribute__((address(0x20bfc),deprecated_definition("consider migrating to #pragma config"),section("__CONFIG2.sec"),space(prog))) __prog__ uint16_t _CONFIG2 = (x);

/*
** Only one invocation of CONFIG2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG2.
** Multiple options may be combined, as shown:
**
** _CONFIG2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Select:
**     POSCMOD_EC           EC oscillator mode selected
**     POSCMOD_XT           XT oscillator mode selected
**     POSCMOD_HS           HS oscillator mode selected
**     POSCMOD_NONE         Primary oscillator disabled
**
**   IOLOCK One-Way Set Enable bit:
**     IOL1WAY_OFF          Unlimited Writes To RP Registers
**     IOL1WAY_ON           Write RP Registers Once
**
**   Primary Oscillator Output Function:
**     OSCIOFNC_ON          OSCO functions as port I/O (RC15)
**     OSCIOFNC_OFF         OSCO functions as CLKO (FOSC/2)
**
**   Clock Switching and Monitor:
**     FCKSM_CSECME         Both Clock switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock switching is enabled, Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock Switching and Fail-safe Clock Monitor are disabled
**
**   Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC oscillator with Postscaler and PLL module (FRCPLL)
**     FNOSC_PRI            Primary oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary oscillator (XT, HS, EC) with PLL module (XTPLL,HSPLL, ECPLL)
**     FNOSC_SOSC           Secondary oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC oscillator (LPRC)
**     FNOSC_FRCDIV         Fast RC oscillator with Postscaler (FRCDIV)
**
**   Internal External Switch Over Mode:
**     IESO_OFF             IESO mode (Two-speed start-up)disabled
**     IESO_ON              IESO mode (Two-speed start-up) enabled
**
*/

#define POSCMOD_EC           0xFFFC
#define POSCMOD_XT           0xFFFD
#define POSCMOD_HS           0xFFFE
#define POSCMOD_NONE         0xFFFF

#define IOL1WAY_OFF          0xFFEF
#define IOL1WAY_ON           0xFFFF

